using Tyuiu.MilyutinND.Sprint1.Task6.V1;
using Tyuiu.MilyutinND.Sprint1.Task6.V1.Lib;

//Напишите программу, которая выводит код введенного пользователем символа.
//Программа должна завершать работу в результате ввода, например, точки.
//Рекомендуемый вид экрана во время выполнения программы приведен ниже.

//Введите символ и нажмите <Enter>. 

//Для завершения введите точку. 

//-> 1

//Символ: 1 Код: 49

//-> .

DataService ds = new DataService();
Console.Title = "Спринт #1 | Выполнил: Милютин Н. Д. | СМАРТб-24-1";
Console.WriteLine("***************************************************************************");
Console.WriteLine("* Спринт #1                                                               *");
Console.WriteLine("* Тема: Базовые навыки работы в C#                                        *");
Console.WriteLine("* Задание #6                                                              *");
Console.WriteLine("* Вариант #1                                                              *");
Console.WriteLine("* Выполнил: Милютин Никита Дмитриевич | СМАРТб-24-1                       *");
Console.WriteLine("***************************************************************************");
Console.WriteLine("* УСЛОВИЕ:                                                                *");
Console.WriteLine("* Напишите программу, которая выводит код введенного пользователем символа*");
Console.WriteLine("* Программа должна завершать работу в результате ввода, например, точки.  *");
Console.WriteLine("* Рекомендуемый вид экрана во время выполнения программы приведен ниже.   *");
Console.WriteLine("* Введите символ и нажмите <Enter>.                                       *");
Console.WriteLine("* Для завершения введите точку.                                           *");
Console.WriteLine("* -> 1                                                                    *");
Console.WriteLine("* Символ: 1 Код: 49                                                       *");
Console.WriteLine("***************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                        *");
Console.WriteLine("***************************************************************************");

//Console.WriteLine("Введи симвод: ");
//string ;

Console.WriteLine("Введите символ и нажмите <Enter>.");
Console.WriteLine("Для завершения введите точку.");
string x;
while (true)
{
    Console.Write("-> ");
    x = Console.ReadLine();

    if (x == ".")
    {
        break; //завершение при точке
    }
    if (x.Length > 0)
    {
        string cod = ds.SymbolCode(x);
        Console.WriteLine("***************************************************************************");
        Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
        Console.WriteLine("***************************************************************************");
        Console.WriteLine($"{x} {cod}");
    }
}
