//Написать программу, которая вычисляет и печатает коэффициент приведенного квадратного уравнения,
//корнями которого являются введенные пользователем два вещественных числа (для справки: b=-x1-x2). Ответ округлите до 3 знаков после запятой.
using Tyuiu.MilyutinND.Sprint1.Task3.V16.Lib;

DataService ds = new DataService();
Console.WriteLine("***************************************************************************");
Console.WriteLine("* ИСХОДНЫЕ ДАННЫЕ:                                                        *");
Console.WriteLine("***************************************************************************");

double x = 0;
double y = 3;
Console.WriteLine("Первый корень = " + x);
Console.WriteLine("Второй корень = " + y);
//коэффициент квадратного уравнения
Console.WriteLine("***************************************************************************");
Console.WriteLine("* РЕЗУЛЬТАТ:                                                              *");
Console.WriteLine("***************************************************************************");

Console.WriteLine("Коэффициент квадратного уравнения: " + ds.CoeffOfQuadraticEquation(x, y));

Console.ReadLine();
